Import pandas

In [1]:
import pandas

Check pandas version

In [2]:
print(pandas.__version__)

0.20.2

### Data Import

Load a csv file

In [3]:
csv_file = pandas.read_csv('./data/feature_engineering.csv')

Check the type of structure of csv_file

In [4]:
type(csv_file)

pandas.core.frame.DataFrame

Now load html table using a url (requires internet connectivity)

In [5]:
url = 'http://www.fdic.gov/bank/individual/failed/banklist.html'

dfs = pandas.read_html(url)

In [6]:
type(dfs)

list

In [7]:
csv_file

    UserId
0        1
1        2
2        3
3        4
4        5
5        6
6        7
7        8
8        9
9       10
10      11
11      12
12      13
13      14
14      15
15      16
16      17
17      18
18      19
19      20
20      21
21      22
22      23
23      24
24      25
25      26
26      27
27      28
28      29
29      30
..     ...
52      53
53      54
54      55
55      56
56      57
57      58
58      59
59      60
60      61
61      62
62      63
63      64
64      65
65      66
66      67
67      68
68      69
69      70
70      71
71      72
72      73
73      74
74      75
75      76
76      77
77      78
78      79
79      80
80      81
81      82

[82 rows x 1 columns]

Load the product data

### Data Selection

In [8]:
product_df = pandas.read_csv('data/product_data.csv')

Print the product data

In [9]:
product_df

   ProductID ProductName   Cost ShippingLocation SellerName
0          1       LEDTV  32990            Delhi    ABC Pvt
1          2     Printer   5990            Delhi    ABC Pvt
2          3    Split AC  32050             Pune    XY Corp
3          4   Microwave  12670           Mumbai    PQ Corp

Select a column

In [10]:
product_df['ShippingLocation']

0     Delhi
1     Delhi
2      Pune
3    Mumbai
Name: ShippingLocation, dtype: object

Select multiple column

In [11]:
listOfCols = ['ProductName','Cost']
product_df[listOfCols]

  ProductName   Cost
0       LEDTV  32990
1     Printer   5990
2    Split AC  32050
3   Microwave  12670

In [12]:
product_df[['ProductName','Cost']]

  ProductName   Cost
0       LEDTV  32990
1     Printer   5990
2    Split AC  32050
3   Microwave  12670

In [13]:
#For selecting rows with index = 2
index = 2
product_df.loc[index]

ProductID                  3
ProductName         Split AC
Cost                   32050
ShippingLocation        Pune
SellerName           XY Corp
Name: 2, dtype: object

In [14]:
#For selecting rows with index less than 2
index = 2
product_df.loc[:index]

   ProductID ProductName   Cost ShippingLocation SellerName
0          1       LEDTV  32990            Delhi    ABC Pvt
1          2     Printer   5990            Delhi    ABC Pvt
2          3    Split AC  32050             Pune    XY Corp

In [15]:
#Select top 2 rows
row = 2
product_df.iloc[:row]

   ProductID ProductName   Cost ShippingLocation SellerName
0          1       LEDTV  32990            Delhi    ABC Pvt
1          2     Printer   5990            Delhi    ABC Pvt

In [16]:
#Select bottom 2 rows
row = 2
product_df.iloc[-row:]

   ProductID ProductName   Cost ShippingLocation SellerName
2          3    Split AC  32050             Pune    XY Corp
3          4   Microwave  12670           Mumbai    PQ Corp

In [17]:
#Select all rows with 3 columns
product_df.iloc[:,1:4]

  ProductName   Cost ShippingLocation
0       LEDTV  32990            Delhi
1     Printer   5990            Delhi
2    Split AC  32050             Pune
3   Microwave  12670           Mumbai

In [18]:
product_df[product_df['Cost']>=30000]

   ProductID ProductName   Cost ShippingLocation SellerName
0          1       LEDTV  32990            Delhi    ABC Pvt
2          3    Split AC  32050             Pune    XY Corp

In [19]:
product_df[(product_df['Cost']>=30000) & (product_df['ShippingLocation']=='Delhi') ]

   ProductID ProductName   Cost ShippingLocation SellerName
0          1       LEDTV  32990            Delhi    ABC Pvt

In [20]:
product_df[(product_df['Cost']>=30000) | (product_df['ShippingLocation']=='Delhi') ]

   ProductID ProductName   Cost ShippingLocation SellerName
0          1       LEDTV  32990            Delhi    ABC Pvt
1          2     Printer   5990            Delhi    ABC Pvt
2          3    Split AC  32050             Pune    XY Corp

In [21]:
product_df[~(product_df['Cost']>=30000)]

   ProductID ProductName   Cost ShippingLocation SellerName
1          2     Printer   5990            Delhi    ABC Pvt
3          4   Microwave  12670           Mumbai    PQ Corp

### Data Cleaning

Renaming the columns

In [22]:
product_df= product_df.rename(columns={'Cost': 'price',
    'shippingLocation': 'destination'})

Insert a column with some value

In [23]:
product_df['NumberOfProduct'] = 1

Checking for null values

In [24]:
product_df.isnull()

,ProductID,ProductName,price,ShippingLocation,SellerName,NumberOfProduct
0,False,False,False,False,False,False
1,False,False,False,False,False,False
2,False,False,False,False,False,False
3,False,False,False,False,False,False

In [25]:
product_df['price'].isnull()

0    False
1    False
2    False
3    False
Name: price, dtype: bool

Drop null values

In [26]:
#Drop all rows having any null value
product_df.dropna(axis=0)

#Drop all columns having any null value
product_df.dropna(axis=1)

#Drop all rows having less than k null values
product_df.dropna(axis=0,thresh=5)

#Drop all columns having all null values
product_df.dropna(axis=0,how='all')

   ProductID ProductName  price ShippingLocation SellerName  NumberOfProduct
0          1       LEDTV  32990            Delhi    ABC Pvt                1
1          2     Printer   5990            Delhi    ABC Pvt                1
2          3    Split AC  32050             Pune    XY Corp                1
3          4   Microwave  12670           Mumbai    PQ Corp                1

Replace values

In [27]:
#Replace all occurrence of 0 with 1
product_df.replace(0,1)

   ProductID ProductName  price ShippingLocation SellerName  NumberOfProduct
0          1       LEDTV  32990            Delhi    ABC Pvt                1
1          2     Printer   5990            Delhi    ABC Pvt                1
2          3    Split AC  32050             Pune    XY Corp                1
3          4   Microwave  12670           Mumbai    PQ Corp                1

Replace NA values

In [28]:
#Fill all NA values,
product_df.fillna(0)

   ProductID ProductName  price ShippingLocation SellerName  NumberOfProduct
0          1       LEDTV  32990            Delhi    ABC Pvt                1
1          2     Printer   5990            Delhi    ABC Pvt                1
2          3    Split AC  32050             Pune    XY Corp                1
3          4   Microwave  12670           Mumbai    PQ Corp                1

Grouping the data

In [29]:
#Grouping on data by SellerName
product_df.groupby('SellerName')

In [30]:
#We can also group data based on multiple columns
regiment_preScore = product_df.groupby(['SellerName','ShippingLocation'])

In [31]:
regiment_preScore

Apply Statistics

In [32]:
product_df['price'].groupby(product_df['SellerName']).mean()

SellerName
ABC Pvt    19490
PQ Corp    12670
XY Corp    32050
Name: price, dtype: int64

In [33]:
product_df['price'].groupby(product_df['SellerName']).count()

SellerName
ABC Pvt    2
PQ Corp    1
XY Corp    1
Name: price, dtype: int64

In [34]:
product_df['price'].groupby(product_df['SellerName']).min()

SellerName
ABC Pvt     5990
PQ Corp    12670
XY Corp    32050
Name: price, dtype: int64

In [35]:
product_df['price'].groupby(product_df['SellerName']).median()

SellerName
ABC Pvt    19490
PQ Corp    12670
XY Corp    32050
Name: price, dtype: int64

In [36]:
product_df['price'].groupby(product_df['SellerName']).std()

SellerName
ABC Pvt    19091.883092
PQ Corp             NaN
XY Corp             NaN
Name: price, dtype: float64

correlation

In [37]:
product_df.corr()

                 ProductID     price  NumberOfProduct
ProductID         1.000000 -0.329618              NaN
price            -0.329618  1.000000              NaN
NumberOfProduct        NaN       NaN              NaN

Get Summary of DataFrame

In [38]:
product_df.describe()

       ProductID         price  NumberOfProduct
count   4.000000      4.000000              4.0
mean    2.500000  20925.000000              1.0
std     1.290994  13669.053857              0.0
min     1.000000   5990.000000              1.0
25%     1.750000  11000.000000              1.0
50%     2.500000  22360.000000              1.0
75%     3.250000  32285.000000              1.0
max     4.000000  32990.000000              1.0

Sort values

In [39]:
#Sort values by cost
product_df.sort_values(by='price')

   ProductID ProductName  price ShippingLocation SellerName  NumberOfProduct
1          2     Printer   5990            Delhi    ABC Pvt                1
3          4   Microwave  12670           Mumbai    PQ Corp                1
2          3    Split AC  32050             Pune    XY Corp                1
0          1       LEDTV  32990            Delhi    ABC Pvt                1

In [40]:
#If we want to sort values in descending order
product_df.sort_values(by='price',ascending=False)

   ProductID ProductName  price ShippingLocation SellerName  NumberOfProduct
0          1       LEDTV  32990            Delhi    ABC Pvt                1
2          3    Split AC  32050             Pune    XY Corp                1
3          4   Microwave  12670           Mumbai    PQ Corp                1
1          2     Printer   5990            Delhi    ABC Pvt                1

In [41]:
#We can also sort values by two or more features
product_df.sort_values(by=['SellerName','price'])

   ProductID ProductName  price ShippingLocation SellerName  NumberOfProduct
1          2     Printer   5990            Delhi    ABC Pvt                1
0          1       LEDTV  32990            Delhi    ABC Pvt                1
3          4   Microwave  12670           Mumbai    PQ Corp                1
2          3    Split AC  32050             Pune    XY Corp                1

In [42]:
product_df.dtypes

ProductID            int64
ProductName         object
price                int64
ShippingLocation    object
SellerName          object
NumberOfProduct      int64
dtype: object

In [43]:
product_df['price'].astype(str)

0    32990
1     5990
2    32050
3    12670
Name: price, dtype: object

Apply functions

In [44]:
#Declare lambda function
smallText =lambda x: x.lower()

#Apply on any column of dataframe
product_df['ShippingLocation'].apply(smallText)

0     delhi
1     delhi
2      pune
3    mumbai
Name: ShippingLocation, dtype: object

Normalizing categorical features

Min Max Normalization

In [45]:
from sklearn import preprocessing

data = {'price': [492, 286, 487, 519, 541, 429]}
price_frame = pandas.DataFrame(data)

min_max_normalizer = preprocessing.MinMaxScaler()
scaled_data = min_max_normalizer.fit_transform(price_frame)
price_frame_normalized = pandas.DataFrame(scaled_data)
price_frame_normalized

          0
0  0.807843
1  0.000000
2  0.788235
3  0.913725
4  1.000000
5  0.560784

Z-Score Normalization

In [46]:
from sklearn import preprocessing

data = {'price': [492, 286, 487, 519, 541, 429]}
price_frame = pandas.DataFrame(data)

min_max_normalizer = preprocessing.scale(price_frame)
price_frame_normalized = pandas.DataFrame(min_max_normalizer,columns=['price'])
price_frame_normalized

      price
0  0.389694
1 -2.042943
2  0.330650
3  0.708535
4  0.968331
5 -0.354268

Bin the data

In [47]:
from sklearn import preprocessing

data = {'age': [28,27,31,31,15,41,61,26,85,9,88,51,26,52,19]}
age_frame = pandas.DataFrame(data)

bins = [0, 20, 40, 60, 100]
group_names = ['Less Than 20 years', '20 to 40 years', '40 to 60 years', '60+ years']

age_frame['categories'] = pandas.cut(age_frame['age'], bins, labels=group_names)
age_frame

    age          categories
0    28      20 to 40 years
1    27      20 to 40 years
2    31      20 to 40 years
3    31      20 to 40 years
4    15  Less Than 20 years
5    41      40 to 60 years
6    61           60+ years
7    26      20 to 40 years
8    85           60+ years
9     9  Less Than 20 years
10   88           60+ years
11   51      40 to 60 years
12   26      20 to 40 years
13   52      40 to 60 years
14   19  Less Than 20 years

Convert Categorical variable to numeric

In [48]:
from sklearn import preprocessing

encoder = preprocessing.LabelEncoder()
encoder.fit_transform(["Delhi", "Pune", "Mumbai", "Delhi"])

array([0, 2, 1, 0], dtype=int64)

In [49]:
encoder.inverse_transform([2,1,1,0])

array(['Pune', 'Mumbai', 'Mumbai', 'Delhi'],
      dtype='<U6')

In [50]:
dummy_frame = pandas.get_dummies(age_frame.categories)
dummy_frame

    Less Than 20 years  20 to 40 years  40 to 60 years  60+ years
0                    0               1               0          0
1                    0               1               0          0
2                    0               1               0          0
3                    0               1               0          0
4                    1               0               0          0
5                    0               0               1          0
6                    0               0               0          1
7                    0               1               0          0
8                    0               0               0          1
9                    1               0               0          0
10                   0               0               0          1
11                   0               0               1          0
12                   0               1               0          0
13                   0               0               1          0
14                   1               0               0          0

In [51]:
import pandas
startDate = '2017-07-06'
endDate = '2017-12-18'
Dates = pandas.DataFrame(pandas.date_range(startDate, endDate),columns=['Dates'])
Dates

         Dates
0   2017-07-06
1   2017-07-07
2   2017-07-08
3   2017-07-09
4   2017-07-10
5   2017-07-11
6   2017-07-12
7   2017-07-13
8   2017-07-14
9   2017-07-15
10  2017-07-16
11  2017-07-17
12  2017-07-18
13  2017-07-19
14  2017-07-20
15  2017-07-21
16  2017-07-22
17  2017-07-23
18  2017-07-24
19  2017-07-25
20  2017-07-26
21  2017-07-27
22  2017-07-28
23  2017-07-29
24  2017-07-30
25  2017-07-31
26  2017-08-01
27  2017-08-02
28  2017-08-03
29  2017-08-04
..         ...
136 2017-11-19
137 2017-11-20
138 2017-11-21
139 2017-11-22
140 2017-11-23
141 2017-11-24
142 2017-11-25
143 2017-11-26
144 2017-11-27
145 2017-11-28
146 2017-11-29
147 2017-11-30
148 2017-12-01
149 2017-12-02
150 2017-12-03
151 2017-12-04
152 2017-12-05
153 2017-12-06
154 2017-12-07
155 2017-12-08
156 2017-12-09
157 2017-12-10
158 2017-12-11
159 2017-12-12
160 2017-12-13
161 2017-12-14
162 2017-12-15
163 2017-12-16
164 2017-12-17
165 2017-12-18

[166 rows x 1 columns]

In [52]:
import numpy
Dates['day'] = Dates['Dates'].map(lambda x:x.day)
Dates['month'] = Dates['Dates'].map(lambda x:x.month)
Dates['da_of_week'] = Dates['Dates'].map(lambda x:x.weekday_name)
Dates['is_weekend'] = Dates['Dates'].map(lambda x:numpy.is_busday(x, weekmask='1111100' ))
Dates

         Dates  day  month da_of_week  is_weekend
0   2017-07-06    6      7   Thursday        True
1   2017-07-07    7      7     Friday        True
2   2017-07-08    8      7   Saturday       False
3   2017-07-09    9      7     Sunday       False
4   2017-07-10   10      7     Monday        True
5   2017-07-11   11      7    Tuesday        True
6   2017-07-12   12      7  Wednesday        True
7   2017-07-13   13      7   Thursday        True
8   2017-07-14   14      7     Friday        True
9   2017-07-15   15      7   Saturday       False
10  2017-07-16   16      7     Sunday       False
11  2017-07-17   17      7     Monday        True
12  2017-07-18   18      7    Tuesday        True
13  2017-07-19   19      7  Wednesday        True
14  2017-07-20   20      7   Thursday        True
15  2017-07-21   21      7     Friday        True
16  2017-07-22   22      7   Saturday       False
17  2017-07-23   23      7     Sunday       False
18  2017-07-24   24      7     Monday        True
19  2017-07-25   25      7    Tuesday        True
20  2017-07-26   26      7  Wednesday        True
21  2017-07-27   27      7   Thursday        True
22  2017-07-28   28      7     Friday        True
23  2017-07-29   29      7   Saturday       False
24  2017-07-30   30      7     Sunday       False
25  2017-07-31   31      7     Monday        True
26  2017-08-01    1      8    Tuesday        True
27  2017-08-02    2      8  Wednesday        True
28  2017-08-03    3      8   Thursday        True
29  2017-08-04    4      8     Friday        True
..         ...  ...    ...        ...         ...
136 2017-11-19   19     11     Sunday       False
137 2017-11-20   20     11     Monday        True
138 2017-11-21   21     11    Tuesday        True
139 2017-11-22   22     11  Wednesday        True
140 2017-11-23   23     11   Thursday        True
141 2017-11-24   24     11     Friday        True
142 2017-11-25   25     11   Saturday       False
143 2017-11-26   26     11     Sunday       False
144 2017-11-27   27     11     Monday        True
145 2017-11-28   28     11    Tuesday        True
146 2017-11-29   29     11  Wednesday        True
147 2017-11-30   30     11   Thursday        True
148 2017-12-01    1     12     Friday        True
149 2017-12-02    2     12   Saturday       False
150 2017-12-03    3     12     Sunday       False
151 2017-12-04    4     12     Monday        True
152 2017-12-05    5     12    Tuesday        True
153 2017-12-06    6     12  Wednesday        True
154 2017-12-07    7     12   Thursday        True
155 2017-12-08    8     12     Friday        True
156 2017-12-09    9     12   Saturday       False
157 2017-12-10   10     12     Sunday       False
158 2017-12-11   11     12     Monday        True
159 2017-12-12   12     12    Tuesday        True
160 2017-12-13   13     12  Wednesday        True
161 2017-12-14   14     12   Thursday        True
162 2017-12-15   15     12     Friday        True
163 2017-12-16   16     12   Saturday       False
164 2017-12-17   17     12     Sunday       False
165 2017-12-18   18     12     Monday        True

[166 rows x 5 columns]

In [53]:
from sklearn.feature_extraction.text import CountVectorizer
comments=['nice product',
         'bad condition',
         'shiiping was bad',
         'great delivery']
count_vect = CountVectorizer()
X_train_counts = count_vect.fit_transform(comments)
word_frame = pandas.DataFrame(X_train_counts.toarray())

#Get all column name and integer index mapping
word_dict = dict((v, k) for k, v in count_vect.vocabulary_.items())

#Now replace integer column names with words
word_frame = word_frame.rename(columns=word_dict)
word_frame

   bad  condition  delivery  great  nice  product  shiiping  was
0    0          0         0      0     1        1         0    0
1    1          1         0      0     0        0         0    0
2    1          0         0      0     0        0         1    1
3    0          0         1      1     0        0         0    0

In [54]:
from sklearn.feature_extraction.text import TfidfVectorizer

tfidf_transformer = TfidfVectorizer()
#tfidf_transformer.fit(X_train_counts)
X_train_tfidf = tfidf_transformer.fit_transform(comments)

word_frame = pandas.DataFrame(X_train_tfidf.toarray())

#Get all column name and integer index mapping
word_dict = dict((v, k) for k, v in tfidf_transformer.vocabulary_.items())

#Now replace integer column names with words
word_frame = word_frame.rename(columns=word_dict)

word_frame

,bad,condition,delivery,great,nice,product,shiiping,was
0,0.000000,0.000000,0.000000,0.000000,0.707107,0.707107,0.000000,0.000000
1,0.619130,0.785288,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
2,0.486934,0.000000,0.000000,0.000000,0.000000,0.000000,0.617614,0.617614
3,0.000000,0.000000,0.707107,0.707107,0.000000,0.000000,0.000000,0.000000

Dimentionality Reduction

In [55]:
from sklearn.decomposition import PCA
pca = PCA()
pca.fit_transform(word_frame)

array([[  5.36362256e-01,  -7.07106781e-01,   7.51836139e-17,
          5.09893376e-17],
       [ -5.36362256e-01,  -6.96319551e-16,  -5.90984029e-01,
          5.09893376e-17],
       [ -5.36362256e-01,  -7.66186799e-16,   5.90984029e-01,
          5.09893376e-17],
       [  5.36362256e-01,   7.07106781e-01,   3.49246184e-17,
          5.09893376e-17]])